app/Controllers/Denda.php

SELECT `denda`.*, `anggota`.`nama` as `nama_anggota`
FROM `denda`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `denda`.`id_anggota`
---
    public function index()
    {
        $db = db_connect();

        $data['denda'] = $db->table('denda')
            ->select('denda.*, anggota.nama as nama_anggota')
            ->join('anggota', 'anggota.id_anggota = denda.id_anggota', 'left')
            ->get()
            ->getResultArray();