app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'kembali'
---
    public function index()
    {
        $data = [
            'total_buku'    => $this->db->table('buku')->countAllResults(),
            'total_anggota' => $this->db->table('anggota')->countAllResults(),
            'total_pinjam'  => $this->db->table('peminjaman')->where('status', 'dipinjam')->countAllResults(),
            'total_kembali' => $this->db->table('peminjaman')->where('status', 'kembali')->countAllResults(),