app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `buku`.`judul` as `nama_buku`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
SELECT *
FROM `denda`
WHERE `id_anggota` = '2'
 LIMIT 1
---
    public function index()
    {
        $db = db_connect();

        $peminjaman = $db->table('peminjaman')
            ->select('peminjaman.*, anggota.nama as nama_anggota, buku.judul as nama_buku')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->get()
            ->getResultArray();

        $dendaModel = new DendaModel();

        foreach ($peminjaman as $p) {

            if ($p['status'] == 'dipinjam' && strtotime($p['tanggal_kembali']) < time()) {

                $telat = floor((time() - strtotime($p['tanggal_kembali'])) / (60*60*24));
                $jumlahDenda = $telat * 1000;

                $cek = $dendaModel
                    ->where('id_anggota', $p['id_anggota'])
                    ->first();

SELECT *
FROM `anggota`
SELECT *
FROM `buku`
SELECT *
FROM `petugas`
---
    public function create()
    {
        $anggota = new AnggotaModel();
        $buku    = new BukuModel();
        $petugas = new PetugasModel();

        $data = [
            'anggota' => $anggota->findAll(),
            'buku'    => $buku->findAll(),
            'petugas' => $petugas->findAll(),
        ];

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '9'
---
    public function store()
    {
        $id_buku = $this->request->getPost('id_buku');

        $bukuModel = new BukuModel();
        $buku = $bukuModel->find($id_buku);

UPDATE `peminjaman` SET `status_bayar` = 'lunas'
WHERE `peminjaman`.`id_peminjaman` IN ('23')
---
    public function bayar($id)
    {
        $this->peminjamanModel->update($id, [
            'status_bayar' => 'lunas'
        ]);