app/Controllers/Peminjaman.php

SELECT *
FROM `peminjaman`
---
    public function index()
    {
        $data['peminjaman'] = $this->peminjamanModel->findAll();