app/Controllers/Pengembalian.php

    public function index()
    {
        $data['pengembalian'] = $this->db->table('pengembalian')
            ->select('pengembalian.*, anggota.nama, buku.judul, peminjaman.tanggal_pinjam')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->get()->getResultArray();
---
SELECT `pengembalian`.*, `anggota`.`nama`, `buku`.`judul`, `peminjaman`.`tanggal_pinjam`
FROM `pengembalian`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`