app/Controllers/Users.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->paginate(10);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function edit($id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function update($id)
    {
        $user = $this->users->find($id);

        $fotoBaru = $this->request->getFile('foto');
        $namaFoto = $user['foto'];

        if ($fotoBaru && $fotoBaru->isValid() && $fotoBaru->getName() != '') {

            if (!empty($user['foto']) && file_exists(FCPATH . 'uploads/users/' . $user['foto'])) {
                unlink(FCPATH . 'uploads/users/' . $user['foto']);
            }

            $namaFoto = $fotoBaru->getRandomName();
            $fotoBaru->move(FCPATH . 'uploads/users', $namaFoto);
        }

        $data = [
            'nama'     => $this->request->getPost('nama'),
            'email'    => $this->request->getPost('email'),
            'username' => $this->request->getPost('username'),
            'role'     => $this->request->getPost('role'),
            'foto'     => $namaFoto
        ];

        if ($this->request->getPost('password') != "") {
            $data['password'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        }

        $this->users->update($id, $data);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
UPDATE `users` SET `nama` = 'gheisya ', `email` = 'gheisya@gmail.com', `username` = 'gheisyasafarina', `role` = 'admin', `foto` = '1777379776_d7143c700b0915c97095.jpg'
WHERE `users`.`id` IN ('1')

    public function detail($id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function print()
    {
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->findAll();
---
SELECT *
FROM `users`